Revit 2027 API
FamilySymbolProfile.XOffset Property
The offset of the profile to the origin of the sketch plane in the X direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double XOffset { get; set; }
Public Property XOffset As Double
	Get
	Set
public:
property double XOffset {
	double get ();
	void set (double value);
}
member XOffset : float with get, set
Property Value
Double
See Also
Reference
FamilySymbolProfile Class
Autodesk.Revit.DB Namespace